huangrong1995/xiaozhi-esp32-volcat/main/boards/esp-vocat/esp_vocat.cc
    static void touch_button_event_callback(touch_button_handle_t handle, uint32_t channel, touch_state_t state, void* cb_arg)
    {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }

        int64_t now = esp_timer_get_time() / 1000;

        if (state == TOUCH_STATE_ACTIVE) {
            self->touch_press_time_ = now;
            self->touch_is_pressed_ = true;

            // Track tap count for triple-tap detection
            if (self->tap_count_ == 0) {
                self->tap_first_time_ = now;
            }
            self->tap_count_++;

            ESP_LOGD(TAG, "Touch PRESS ch=%" PRIu32 " (tap %d)", channel, self->tap_count_);
        } else if (state == TOUCH_STATE_INACTIVE) {
            // Detect release by state change from ACTIVE to INACTIVE
            if (!self->touch_is_pressed_) {
                return;
            }
            self->touch_is_pressed_ = false;
            int64_t press_duration = now - self->touch_press_time_;

            // Long press detection (release after holding > threshold)
            if (press_duration >= kLongPressThresholdMs) {
                ESP_LOGI(TAG, "Gesture: LONG PRESS (%" PRId64 " ms)", press_duration);
                if (self->emotion_learning_mode_) {
                    self->ExitEmotionLearningMode();
                } else {
                    self->ShowLongPressFeedback();
                }
            }
            // Single tap - check triple-tap timeout first
            else {
                int64_t time_since_first_tap = now - self->tap_first_time_;
                if (time_since_first_tap > kDoubleTapThresholdMs + 200) {
                    // Timeout exceeded, reset and treat as single tap
                    ESP_LOGI(TAG, "Gesture: SINGLE TAP (timeout reset)");
                    if (self->emotion_learning_mode_) {
                        self->ShowEmotionLearningNext();
                    } else {
                        self->ShowSingleTapFeedback();
                    }
                    self->tap_count_ = 0;
                } else if (self->emotion_learning_mode_) {
                    // In emotion learning mode, single tap immediately advances
                    ESP_LOGI(TAG, "Gesture: SINGLE TAP (emotion learning)");
                    self->ShowEmotionLearningNext();
                    self->tap_count_ = 0;
                }
                // else: wait for more taps (potential double/triple tap)
            }

            self->touch_last_release_time_ = now;
        }

        // Check for triple tap after each release
        if (self->tap_count_ >= 3) {
            int64_t time_since_first = now - self->tap_first_time_;
            if (time_since_first <= kDoubleTapThresholdMs + 200) {
                ESP_LOGI(TAG, "Gesture: TRIPLE TAP");
                if (self->emotion_learning_mode_) {
                    // Already in mode, do nothing or restart
                    self->current_emotion_index_ = 0;
                    self->ShowEmotionLearningCurrent();
                } else {
                    self->EnterEmotionLearningMode();
                }
                self->tap_count_ = 0;
            }
        }
    }

    static void touch_cap_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr) {
                if (self->touch_slider_handle_ != nullptr) {
                    touch_slider_sensor_handle_events(self->touch_slider_handle_);
                } else if (self->touch_button_handle_ != nullptr) {
                    touch_button_sensor_handle_events(self->touch_button_handle_);
                }
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeCapacitiveTouchPads()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Capacitive touch disabled: TOUCH_PAD1 NC");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        if (ch1 == 0) {
            ESP_LOGW(TAG, "TOUCH_PAD1 GPIO %d is not a touch channel (expect GPIO1..GPIO14)", (int)TOUCH_PAD1);
            return;
        }

        if (TOUCH_PAD2 != GPIO_NUM_NC) {
            const uint32_t ch2 = TouchChannelFromPadGpio(TOUCH_PAD2);
            if (ch2 == 0) {
                ESP_LOGW(TAG, "TOUCH_PAD2 GPIO %d is not a touch channel", (int)TOUCH_PAD2);
                return;
            }

            static uint32_t slider_ch[2];
            static float slider_thr[2];
            slider_ch[0] = ch1;
            slider_ch[1] = ch2;
            slider_thr[0] = 0.004f;
            slider_thr[1] = 0.006f;

            touch_slider_config_t sld_cfg = {
                .channel_num = 2,
                .channel_list = slider_ch,
                .channel_threshold = slider_thr,
                .channel_gold_value = nullptr,
                .debounce_times = 1,
                .filter_reset_times = 5,
                .position_range = 10000,
                .calculate_window = 2,
                .swipe_threshold = 28.f,
                .swipe_hysterisis = 22.f,
                .swipe_alpha = 0.9f,
                .skip_lowlevel_init = false,
            };
            esp_err_t err = touch_slider_sensor_create(&sld_cfg, &touch_slider_handle_, touch_slider_event_callback, this);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "touch_slider_sensor_create failed: %s", esp_err_to_name(err));
                touch_slider_handle_ = nullptr;
                return;
            }
            xTaskCreatePinnedToCore(touch_cap_poll_task, "touch_cap", 3072, this, 3, &touch_slider_task_handle_, 1);
            ESP_LOGI(TAG, "Touch slider (PCB v1.2+): PAD1 GPIO%d ch%u, PAD2 GPIO%d ch%u",
                     (int)TOUCH_PAD1, (unsigned)slider_ch[0], (int)TOUCH_PAD2, (unsigned)slider_ch[1]);
            return;
        }

        static uint32_t btn_ch[1];
        static float btn_thr[1];
        btn_ch[0] = ch1;
        btn_thr[0] = 0.004f;

